CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/radiativeHeatFlux/CFD/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type               fixedRadHeatFlux; 
       radHeatFlux        6205; 
       gradient           uniform 0.0; 
    }
    outlet
    {
       type            MarshakRadiationFixedTemperature;
       Trad            uniform 500;
       emissivityMode  lookup;
       emissivity      uniform 1;
       value           uniform 0;
    }

    "(right|left|up|down)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
