CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/radiativeHeatFlux/CFD/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 500; // fluid temperature, inconsequential

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField; 
    }
    outlet
    {
        type            zeroGradient;
    }

    "(right|left|up|down)"
   {
       type            cyclic;
   }
}

// ************************************************************************* //
