CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/radiativeHeatFlux/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                              Gauss linear;
    div(phi,U)                           Gauss limitedLinearV 1;
    div(phi,k)                           Gauss limitedLinear 1;
    div(phi,h)                           Gauss limitedLinear 1;
    div(phi,epsilon)                     Gauss limitedLinear 1;
    div(phi,R)                           Gauss limitedLinear 1;
    div(R)                               Gauss linear;
    div(phi,nuTilda)                     Gauss limitedLinear 1;
    div((nuEff*dev(grad(U).T())))        Gauss linear;
    div((viscousTerm*dev(grad(U).T())))  Gauss linear;
    div((nu*dev(grad(U).T())))           Gauss linear;
    div(phi,T)                           Gauss limitedLinear 1; 
}

laplacianSchemes
{
    default                           Gauss linear corrected;
    laplacian(nuEff,U)                Gauss linear corrected;
    laplacian(viscousTerm,U)          Gauss linear corrected;
    laplacian(nu,U)                   Gauss linear corrected;
    laplacian((1|A(U)),p)             Gauss linear corrected;
    laplacian((voidfraction2|A(U)),p) Gauss linear corrected;
    laplacian(DkEff,k)                Gauss linear corrected;
    laplacian(DepsilonEff,epsilon)    Gauss linear corrected;
    laplacian(DREff,R)                Gauss linear corrected;
    laplacian(DnuTildaEff,nuTilda)    Gauss linear corrected;
    laplacian((DT*voidfraction),T)    Gauss linear corrected;
    laplacian(gammaRad,G)             Gauss harmonic corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
